[
  {"fact": "A triangle’s angles always sum up to 180 degrees."},
  {"fact": "A square is a rectangle with all sides equal in length."},
  {"fact": "The sum of the interior angles of any quadrilateral is 360 degrees."},
  {"fact": "A regular polygon has all sides and all angles equal."},
  {"fact": "In an isosceles triangle, at least two sides are of equal length."},
  {"fact": "A diameter of a circle is the longest possible chord of that circle."},
  {"fact": "All radii of a given circle are equal in length."},
  {"fact": "A right angle measures exactly 90 degrees."},
  {"fact": "An acute angle measures less than 90 degrees."},
  {"fact": "An obtuse angle measures greater than 90 degrees but less than 180 degrees."},
  {"fact": "A straight angle measures exactly 180 degrees."},
  {"fact": "A parallelogram is a quadrilateral where opposite sides are parallel and equal."},
  {"fact": "Opposite angles in a parallelogram are equal."},
  {"fact": "A trapezoid (or trapezium) has at least one pair of parallel sides."},
  {"fact": "The angles on a straight line sum up to 180 degrees."},
  {"fact": "The sum of the interior angles of a pentagon is 540 degrees."},
  {"fact": "The sum of the interior angles of a hexagon is 720 degrees."},
  {"fact": "The shortest distance from a point to a line is always a perpendicular line."},
  {"fact": "All angles in an equilateral triangle measure 60 degrees."},
  {"fact": "A rhombus is a parallelogram with four equal sides."},
  {"fact": "A square is a rhombus with right angles."},
  {"fact": "In a circle, the circumference is π times the diameter."},
  {"fact": "A tangent to a circle is perpendicular to the radius at the point of tangency."},
  {"fact": "The sum of the exterior angles of any polygon, one at each vertex, is always 360 degrees."},
  {"fact": "Similar polygons have angles that are equal and sides that are in proportion."},
  {"fact": "Congruent figures have the same shape and size."},
  {"fact": "In a right triangle, the square of the hypotenuse equals the sum of the squares of the other two sides (Pythagorean theorem)."},
  {"fact": "A circle has an infinite number of lines of symmetry."},
  {"fact": "An equilateral triangle is also equiangular, and vice versa."},
  {"fact": "In a circle, a chord that passes through the center is a diameter."},
  {"fact": "The sum of the interior angles of a triangle is always the same, no matter what the shape of the triangle is."},
  {"fact": "A polygon with all angles less than 180 degrees is called a convex polygon."},
  {"fact": "A polygon with at least one angle greater than 180 degrees is called a concave polygon."},
  {"fact": "In a regular polygon, each interior angle can be calculated using the formula: (n-2)*180°/n, where n is the number of sides."},
  {"fact": "All squares are rectangles, but not all rectangles are squares."},
  {"fact": "A kite is a quadrilateral with two pairs of adjacent sides equal."},
  {"fact": "The angle bisector of a triangle divides the opposite side into segments proportional to the adjacent sides."},
  {"fact": "The perpendicular bisector of a line segment is the set of all points equidistant from the segment’s endpoints."},
  {"fact": "If two angles are complementary, they sum to 90 degrees."},
  {"fact": "If two angles are supplementary, they sum to 180 degrees."},
  {"fact": "A regular hexagon can be divided into 6 equilateral triangles."},
  {"fact": "A regular pentagon has 5 lines of symmetry."},
  {"fact": "A square has 4 lines of symmetry."},
  {"fact": "An equilateral triangle has 3 lines of symmetry."},
  {"fact": "A circle has a constant radius at every point on its circumference."},
  {"fact": "Parallel lines never intersect, no matter how far they are extended."},
  {"fact": "A transversal line crossing parallel lines creates corresponding angles that are equal."},
  {"fact": "The altitude (height) of a triangle is a perpendicular line drawn from a vertex to the opposite side."},
  {"fact": "A median of a triangle connects a vertex to the midpoint of the opposite side."},
  {"fact": "In an isosceles triangle, the altitude drawn from the vertex angle also acts as a median and angle bisector."},
  {"fact": "In a right triangle, the median to the hypotenuse is half the length of the hypotenuse."},
  {"fact": "The incenter of a triangle is the point where the angle bisectors intersect and is the center of the inscribed circle."},
  {"fact": "The circumcenter of a triangle is the point where the perpendicular bisectors intersect and is the center of the circumscribed circle."},
  {"fact": "The centroid of a triangle (where medians meet) divides each median into segments with a 2:1 ratio."},
  {"fact": "The orthocenter of a triangle is the point where all three altitudes intersect."},
  {"fact": "An angle formed by two chords in a circle is half the sum of the measures of the arcs they subtend."},
  {"fact": "A secant is a line that intersects a circle in two points."},
  {"fact": "An inscribed angle in a circle is half the measure of its intercepted arc."},
  {"fact": "Regular polygons are both equiangular and equilateral."},
  {"fact": "The area of a rectangle is the product of its length and width."},
  {"fact": "The area of a triangle is half the product of its base and height."},
  {"fact": "The volume of a rectangular prism is the product of its length, width, and height."}
]
